{"Obsidian/Obsidian---The-Right-Way":{"slug":"Obsidian/Obsidian---The-Right-Way","filePath":"Obsidian/Obsidian - The Right Way.md","title":"Obsidian - The Right Way","links":[],"tags":[],"content":"AI Obsidian Gold\n\n1. Plugins for Obsidian\nObsidian Plugins (Settings → Community Plugins → Browse):\n\nTemplater by SilentVoid\nDataview by Michael Brenan\nDataCards by Sophokles187\nDataview Serializer by Sebastien Dubois\nSmart Connections by Brian Petro\nStyle Settings by mgmeyers\n\nDon’t forget to click Enable after you click Install and they get done. Obsidian doesn’t auto-enable community plugins.\nThere are others, but they are more niche, and I’m looking to get you started with minimal easy steps that do the most for you.\n\n2. Themes for Obsidian\nITS Theme is a gorgeous, flat, matte theme with black, grays, and deep reds that are easy on the eyes with an amazing font. Images of mine attached for your viewing.\nObsidian Themes: (Settings → Appearance → Themes → Manage)\n\n\nITS Theme by SIRvb - is the one I use, I can’t recommend it enough.\n\n\nMinimal by kepano - is recommend by a lot of power users.\n\n\nAnuPpuccin by Anubis - Looks fantastic, but it has a TON of color pallets to choose from.\n\n\nObsidianite by Benny Guo - is gorgeous, it’s a dark one with black, purples, shades of blue, and a icy blue font color.\n\n\n\n3. Local AI &amp; Embedding\nWe need to get you a local AI setup going to handle embedding. Embedding is… well, who better to explain a concept/tool/method we’ll use AI for, than an AI itself? I’ll let GPT handle this one.\nFeel free to skip the quoted What is Embedding section, it’s only here just in case you want to know what it is, and how it works, so you understand why people (and AI) love it and add it.\nWhat is Embedding? (A RAG concept)\n\nImagine your notes and documents are a giant library—tons of pages, topics, thoughts, ideas. Now imagine you have a friend who’s really good at finding things, even if you don’t describe them perfectly or remember the exact wording. You say:\n&quot;Find something about how I fixed my server issue last month&quot;\nand instead of searching only for those exact words, this friend understands what you’re asking and pulls up the right information—even if you actually wrote resolved nginx timeout instead. That friend is an Embedding model.\nAt its core, an Embedding is a way of converting text into numbers. But not random numbers—numbers arranged so that similar ideas end up close together.\nInput: Words, sentences, documents. Any text, including formats like markdown, HTML, etc.\nEmbedding: Turns those into points in a 3D-like map that is thousands of dimensions. It’s called a vector map.\nEmbedded Numbers: Cause the AI to understand that, similar meaning = close together, different meaning = far apart. If dinosaur is 0.8765091, then lizard might be 0.8765008, and cloud might be 0.2144313.\nThis Allows: The AI you talk to, to go from comparing text as raw letters, to actually comparing meaning.\nWhat does this mean for Obsidian?\nIf you have 2,000 notes, traditional searching only finds matches if the words are exact. If you search for Dinosaur, you get the word Dinosaur, that’s it. But asking AI to search after embedding, now you get a list of all the dinosaurs you wrote about, that snippet of how raptors became chickens that you saved, and that reminder you set to wear your T-Rex costume to your friends party. The more context you give the AI when asking to search for you, the better results you will get after embedding, normal searches do not come close to this.\nFinal Example:\nYou tell your AI chat in Obsidian: Show me my notes about troubleshooting network errors.\nBut you only wrote this in the note: I fixed connectivity issues with my router by adjusting DNS.\nA normal search might miss that and come back with 0 results. But with embeddings your AI sees:\n\nnetwork errors\nconnectivity issues\nrouter DNS problem\n\nAll 3 of those live next to each other in the embedding space so the AI says &quot;These ideas are related, I will pull this information for the user.&quot;\nFinal Summary of Embedding:\nEmbeddings turn your notes into meaning-based search, so you can find things even when you don’t remember the exact words you used.\n\nollama + Qwen3:\n\nGo to ollama.com/download and download then install the Windows version. This allows you to run open AI models locally. This will hit your GPU/CPU/RAM a bit, but only when the model is actively doing things and not sitting idle.\nOpen PowerShell (Preferably Windows Terminal with PowerShell 7 as your console, cause we’re big boy IT guys now), type ollama and send, it should print a list of help commands if it installed and is running.\nSame terminal run ollama pull qwen3-embedding:8b and ollama will download the 8 billion parameter embedding model by Qwen3 (Google but open source).\nMake sure ollama desktop is running, if it is just minimize it, don’t close it. When minimized it should “close” the window and still be running in the task bar with your other little icons.\n\n\n4. Smart Connections Chat-Bot + Open Router API (The Big Brain) + Embedding with Ollama\nNow you’re cooking, you’re so close to having an amazing AI setup in your Obsidian which is going to help a LOT, trust. But, how is embedding going to help if you can’t actually talk to the AI that handles it? That’s right, embedding AI models aren’t meant for chatting and normal tasks, they are very specialized and trained to do one thing, and do it very well. Now we need an actual LLM model. Not only are we getting a big boy LLM your PC can’t even handle, we’re going to do it for free.\nWe need to setup an Open Router account for you, then edit the Smart Connections plugin setting in Obsidian. There’s other settings you can tweak in it, but for now we’re going to just get your AI’s up and running.\nOpenRouter:\n\nGo to openrouter.ai/ and make a free account. Make yourself an API key, name it what you want, I’d recommend Obsidian Chat just so you know what it is. Copy the API key and slap it into Notepad or something for now. Pretty sure it’s gone as soon as you close the little API window, you’ll most likely have to make another if you lose it before using it.\n\nSmart Connections:\n2. Go back to Obsidian and go to Settings → Smart Chat → Scroll down to the Model section.\n3. Chat Model Platform: Select Open Router\n4. API Key: Put in the Open Router API key you generated earlier with your Open Router Account.\n5. Refresh Models: Click the Refresh Models button.\nNow we need a sick nasty big boy LLM that is good at chatting, reasoning, taking instruction, and general use\nOpenRouter, again:\n\nGo to the models page or just use my link: openrouter.ai/models\nOn the left side panel expand Prompt pricing and drag the right circle all the way to the left circle. This should only show free models, which is what we want. Be sure to double check each one, sometimes they accidentally add paid ones in.\nOn the left side panel expand Context length While we can use smaller models, I would say use one with at least 128K context. So move the circle for the slider up to the first line past 64K and take a look at the models.\nNote: Unfortunately at some point to do this efficiently you will need to learn about models to some extent, take your time reading them as different models are designed for different things. For example, TNG: R1T Chimera is mostly used for roleplaying, whereas Mistral: Devstral 2 2512 is used for coding and dev work.\nMy Recommendations: At this time, 12/10/2025, I would say choose Amazon: Nova 2 Lite (free), Tongyi DeepResearch 30B A3B (free), OpenAI: gpt-oss-120b (free), TNG: DeepSeek R1T2 Chimera (free), or Qwen: Qwen3 235B A22B (free). Out of those 5, I would probably try DeepSeek R1T2, Qwen3 235B, and gpt-oss-120b first, in that order.\nOnce you know what model you want, head back into Smart Connections Settings.\n\nSmart Connections again:\n\nGo to Chat Model and click the empty box. Scroll down and find the one you want, click it.\nGo down to Smart Environment and click on Show Environment Settings.\nScroll down to Smart Sources.\nFind Embedding model platform and click the box beside it. Choose Ollama (Local).\nUnder that you should see Embedding Model, click the box beside it and choose qwen3-embedding:8b.\n\n5. Success!\nThat is it! You should now have a fully functioning embedding system that works automatically any time you make changes to a note. If you have a lot of notes you might hear your GPU spin up for a while as the embedding model we’re running locally uses your GPU to do everything. So don’t do this initially if you’re fixing to play a game and you have a bunch of notes.\nTo actually talk to the AI, look on your left side bar in Obsidian and find the icon that looks like a conversation box from a comic with a smile face in it.  If you hover over it you should get a text popup that shows Open: Smart Chat. Click that and a new tab will open. You can expand here, name your chats, start a new fresh one, check your chat history, open chat settings, and more. But that’s another topic for another time.\nYou did it, this guide was a lot to read, but I went step-by-step, and together our efforts should have you a gorgeous theme, full AI with powerful LLM’s backing them up, and a full local embedding system up and running.\n6. What’s Next?\nI will have more guides coming soon, such as how to write better notes, different ways to make use of the AI, how to use the plugins we installed earlier, and more! So look forward to it and I hope you enjoy your new Obsidian setup friends."},"X-Clash/Union-Duel-VS-Guide":{"slug":"X-Clash/Union-Duel-VS-Guide","filePath":"X-Clash/Union Duel VS Guide.md","title":"Union Duel VS Guide","links":[],"tags":[],"content":"Weekly VS Guide\nWelcome\nThis guide is not perfect. It’s not a end-all be all. You don’t have to follow it perfectly, you’re not going to memorize it all immediately, and things may change in the future. This is a guide meant to get you going and have you on the best possible path currently going forward.\nSpecial thanks to Animality from the Official X-Clash Discord server as most of the information came from his guides and videos.\n\nDay 1: Intelligence Training\n\nIntelligence quest - BEFORE THIS DAY STARTS, perform intelligence quest using stamina, but DO NOT collect them or tap the red dots just yet, open them once the VS event starts.\nDispatch your teams to gather resources (food, iron, gold) hours before Server Reset.\nStamina, Mystic Beast Breakthrough and EXP Potion - use then all at once during Arms Race: Mystic Beast Training .\nHero EXP - use them during Arms Race: Enhance Hero.\n\n\nDay 2: Castle Construction\n\nIn this day, do not perform any Intelligence Quest\nDispatch Legendary Wagons - Not connected to Arms Race, you can do this anytime.\nGold Tavern Quest - Not connected to Arms Race, you can do this anytime.\nSurvivor Recruitment - Located in Hero &gt; Obtain Hero &gt; Survivor Recruitment. Not connected to Arms Race, you can do this anytime.\nBuilding Upgrade - You should do this during Arms Race: Construction City.\n\nNote: You can upgrade any building anytime but DO NOT open the gift wrap when they are finished. Open them only during Arms Race or during Arms Race + Construction Day of the VS events. This will give you a lot of points during such events. On this Day, save up intelligence quest again, for Day3 of the event.\n\nDay 3: Technology Research\n\nMystic Beast Mark Chest - Save them all for this day, do not open them and only do it in the Day3 of the VS events. Not connected to Arms Race, you can do this anytime.\nEnergy Crystals - These crystals should only be exclusive to Day3 of the VS events. Save them all only for this day. Use these crystals during Arms Race: Technology Research.\n\n\nDay 4: Hero Upgrade\n\nHero Shards - Not connected to Arms Race, you can do this anytime.\nSkill Exp Book - Not connected to Arms Race, you can do this anytime.\nHero Recruit and Hero Exp - Do this both during Arms Race: Enhance Hero\n\nNote: In this Day, save up intelligence quest again, for Day5 of the event.\n\nDay 5: Full Preparation\n\nDo all of the guides mentioned from Day1 to Day4 combined. Do them all during their Arms Race.\nSoldiers Training - Before this Day, DO NOT over train too much, save resources and speedups to train for this day.\n\n\nDay 6: Defeat the Enemy\n\nIf you have any wounded troops in your hospital the day before this one, do not heal them yet, do it only once this day arrives.\nKilling soldiers grants a lot of massive points depending on their level.\nHaving your troops killed also grants points.\nBe vigilant, be smart and stay sharp on this day.\n\n\nDay 7: Rest Day\n\nSave everything, especially Intelligence Quest for Day 1 of the VS events again.\n"},"index":{"slug":"index","filePath":"index.md","title":"Docs With Friends","links":[],"tags":[],"content":"Welcome to the Archive\nYou’ve found our little corner of the internet. This is a living collection of guides, strategies, and technical notes built specifically for our crew.\nWhether you are here to fix your Obsidian setup, optimize a build, or figure out how to win our latest game obsession, you are in the right place.\n\nWhat’s Inside?\n\n🎮 Gaming Guides: Strategies, dailies, and walkthroughs (including that Union Duel VS Guide).\n📓 Obsidian &amp; Tech: How to set up your own digital garden, software tips, and hardware advice.\n🔮 Coming Soon: We have big plans for the future! Expect guides on DIY projects, server tinkering, and other fancy stuff to drop here eventually.\n\n\nHow to use this site\nEverything is linked. You can browse the folders using the Explorer on the left, or just use the Search Bar to jump straight to what you need.\n\n\n\n“Knowledge is better when it’s shared.”\n"}}